[
  {
    "stepDate": "Feb,2022 - Present",
    "stepTitle": "Huawei",
    "stepPosition": "Software Engineer",
    "selected": true,
    "description": [
      "WeCare Web App: Developed the WeCare web app, facilitating weekly employee surveys for health assessments. Implemented a system to collect team leaders' feedback, generating monthly reports for managerial insights into employee well-being, statistics, and issue tracking.",
      "RQC Web App and Dashboard: Spearheaded the development of the RQC web app, enabling auditors to remotely audit EHS and QC tasks in Northern Africa. Improved process efficiency and quality while creating a user-friendly interface. Also, crafted an RQC Dashboard to showcase auditors' performance, efficiency, and utilization.",
      "All-In-One Dashboard: Constructed an All-In-One Dashboard providing a comprehensive visualization of cost savings in the Northern Africa region, aligning with the All-In-One Strategy.",
      "AI Model for PPE Checks: Engineered an AI model automating the process of inspecting Personal Protective Equipment (PPE) for EHS tasks, enhancing accuracy and efficiency.",
      "AI Model for RRU Detection: Designed an AI model streamlining the acceptance process for QC tasks through Remote Radio Unit (RRU) detection, optimizing the efficiency of quality control procedures.",
      "Chatbot Maintenance: Managed and maintained a responsive Chatbot for the department, offering swift responses to inquiries related to progress, daily plans, alarms, and other relevant topics, ensuring effective communication within the team."
    ],
    "skills": [
      "Python",
      "JavaScript",
      "HTML",
      "CSS",
      "Vue.js",
      "SQL",
      "Adobe Photoshop",
      "Adobe Illustrator"
    ]
  },
  {
    "stepDate": "Jun,2021 - Feb,2022",
    "stepTitle": "Freelancer",
    "stepPosition": "Software Engineer",
    "selected": false,
    "description": [
      "Worked as FreeLancer and Developed the Account Management System A Desktop Flutter app for windows that aims to manage Bills, Imports, and Exports. Also this application is secured with password and data are encrypted\n\nThis application was built for Resolution company.",
      "Build QR Attendance Flutter App that Scan Attendees QR and record their Attendance on Google Sheets."
    ],
    "skills": [
      "Flutter",
      "Python",
      "Java",
      "JavaScript",
      "HTML",
      "CSS",
      "React",
      "Figma",
      "Adobe Photoshop",
      "Adobe Illustrator",
      "Adobe XD"
    ]
  }
]
